app/controllers/bites_controller.rb

  def index
    @bites = Bite.all
---
SELECT "bites".* FROM "bites"

  def create
    # @bite = Bite.new(bite_params)
    @bite = current_user.bites.build(bite_params)

    respond_to do |format|
      if @bite.save
---
INSERT INTO "bites" ("image", "name", "description", "price", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @bite.update(bite_params)
---
UPDATE "bites" SET "description" = ?, "updated_at" = ? WHERE "bites"."id" = ?  [["description", "Several pastas tossed together with a vinaigrette and a variety of fresh, preserved or cooked ingredients."], ["updated_at", "2023-04-30 07:13:35.023372"], ["id", 19]]

  def destroy
    @bite.destroy
---
DELETE FROM "bites" WHERE "bites"."id" = ?  [["id", 11]]

def correct_user
  @bite = current_user.bites.find_by(id: params[:id])
---
SELECT "bites".* FROM "bites" WHERE "bites"."user_id" = ? AND "bites"."id" = ? LIMIT ?  [["user_id", 13], ["id", 9], ["LIMIT", 1]]

    def set_bite
      @bite = Bite.find(params[:id])
---
SELECT "bites".* FROM "bites" WHERE "bites"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]